# Core packages required for basic dotfiles functionality
stow
git
git-lfs
zsh

# Wayland/Hyprland ecosystem
hyprland
hyprlock
hypridle
uwsm

# System bar & utilities
waybar
xdg-utils

# Audio system
wireplumber
pamixer
wiremix
easyeffects

# Brightness control
brightnessctl
ddcutil
swayosd

# Bluetooth
bluez-utils
bluetui

# Terminal & shell
ghostty
starship
fastfetch

# Editors
helix

# Fonts
ttf-hack-nerd

# Password manager
1password

# System utilities
jq
networkd-dispatcher
