# Optional packages for enhanced functionality

# Development tools
zed
mise

# Enhanced CLI tools
eza
fzf
bat
zoxide
lazygit
lazydocker
gum
btop
atuin

# Python tooling
uv

# Database tools
postgresql

# Image processing
imagemagick

# Document viewers
zathura
zathura-pdf-poppler

# Applications
nautilus
signal-desktop
obsidian
typora
chromium

# VPN & networking
tailscale

# Command correction (AUR)
thefuck
